In [2]:
'''Q1  Write code to create a dataframe from a dictionary and display it.
 Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} '''

import pandas as pd
data = {'X': [78, 85, 96, 80, 86],
        'Y': [84, 94, 89, 83, 86],
        'Z': [86, 97, 96, 72, 83]}
df = pd.DataFrame(data)
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [9]:
'''  Write code to create and display a DataFrame from a specified dictionary data which has the
index labels. Retrieve the first 3 rows of a given DataFrame.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] '''



import pandas as pd
import numpy as np
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
print("DataFrame:")
print(df)
print("\nFirst 3 rows of the DataFrame:")
print(df.head(3))
#print(df.loc[['a','b','c']])

DataFrame:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

First 3 rows of the DataFrame:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [16]:
# Q3  Write code to select the 'name' and 'score' 

print(df[['name', 'score']])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [22]:
#Q4   Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.


print(df.loc[['b', 'd', 'f', 'g'], ['name', 'score']])

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [4]:
#Q5 Select the rows where the number of attempts in the examination is greater than 2.

import pandas as pd
import numpy as np


df[df['attempts'] > 2]

NameError: name 'df' is not defined

In [18]:
#Q6 Select the rows where the score is missing, i.e. is NaN


df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [19]:
#Q7 Select the rows where number of attempts in the examination is less than 2 and score greater than 15.

df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [22]:
#Q8 Delete the row of Dima 

df.drop(df[df['name'] == 'Dima'].index)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [33]:
#Q9 Set the index to the column ‘name

df = pd.DataFrame(exam_data,labels)
df = df.set_index('name')
print(df)

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [36]:
#Q10 Select the row with index value as ‘James’

df.loc[['James']]

       score  attempts qualify
name
James    NaN         3      no

In [39]:
#Q11  replace all the NaN values with Zero's.

df.fillna(0)

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        0.0         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        0.0         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

In [7]:
#Q12 Reset the index


df = pd.DataFrame(exam_data, index=labels)
df = df.set_index('name')
df_reset = df.reset_index()
print(df_reset)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [9]:
#Q13 

print("dataFrame1:")
a={'courses':['cfg'],'fee':[20000]}
df =pd.DataFrame(a)
print(df)

dataFrame1:
  courses    fee
0     cfg  20000

In [1]:
#Q 14

print("vertical1:")
print(pd.concat([dataFrame1,dataFrame2],axis=0))
print("Vertical:")
print(pd.concat([dataFrame2,dataFrame3],axis=1))

vertical1:

NameError: name 'pd' is not defined